/**
 * 游戏配置数据类型
 */
export default {
    //============== 界面层级 =================
    view_zOrder_2000: 2000,
    view_zOrder_3000: 3000,
    view_zOrder_4000: 4000,
    view_zOrder_5000: 5000,
    /**最高层级 */
    view_zOrder_9999: 9999,

    /**墙层级 */
    wall_zOrder: 0,

    //============== 游戏角色 =================
    /** 房主 */
    userRole_5: 5,
    /** 管理员 */
    userRole_10: 10,
    /** 主播 在他人房间上麦 */
    userRole_15: 15,
    /** 旁听 在他人房间旁听 */
    userRole_20: 20,

    //============== 结束界面类型 =================
    /**胜利 */
    result_type_1: 1,
    /**失败 */
    result_type_2: 2,
    /**平局 */
    result_type_3: 3,

    /**玩家类型是不是ai */
    ai_type: 2,

    //============== 玩家性别 ================= 
    /**男 */
    sex_type_1: 1,
    /**女 */
    sex_type_2: 2,


    //============== 玩家类型 =================
    /**玩家1  */
    player_type_1: 0,
    /**玩家2  */
    player_type_2: 1,

    //============== 颜色类型 =================
    /**蓝色 */
    color_type_1: 1,
    /**红色 */
    color_type_2: 2,


    //============== 协议编号 =================
    /**join 加入房间  */
    net_id_0: 0,
    /**ready 准备  */
    net_id_1: 1,
    /**游戏状态更新 angle 角度 */
    net_id_6: 6,
    /**离开游戏房间 */
    net_id_5: 5,
    /** 游戏结束  */
    net_id_7: 7,
    /** mic 麦克同步 @param mic */
    net_id_8: 8,
    /**获取语音聊天参数 */
    net_id_12: 12,
    /**获取道具列表 */
    net_id_14: 14,

    /**协议头 => 每个游戏都不同 */
    net_guide: 'proto.SNAKE',

    //============== 游戏提示层类型 =================
    /**游戏说明 */
    alter_type_1: 1,
    /**退出游戏提示 */
    alter_type_2: 2,
    /**余额不足 */
    alter_type_3: 3,

}